itsme-SP/workspace/stm32f401re_new/Src/004_button_interrupt_test.c
/*
 * button_interrupt_test.c
 *
 *  Created on: Aug 20, 2025
 *      Author: Shivaprasad
 */

#include <stdio.h>
#include "stm32f_gpio_driver.h"
void delay(){
	for(int i=0;i<50000;i++);
}
int main (void){
	GPIO_HANDLE_t GPIO_led,GPIO_btn;
	memset(&GPIO_led,0,sizeof(GPIO_led));
	memset(&GPIO_btn,0,sizeof(GPIO_btn));
	GPIO_led.pGPIOx=GPIOA;
	GPIO_led.GPIO_PINCONFIG.GPIO_PIN_NUMBER=GPIO_PIN_NO_5;
	GPIO_led.GPIO_PINCONFIG.GPIO_PIN_MODE=GPIO_MODE_OUT;
	GPIO_led.GPIO_PINCONFIG.GPIO_PIN_SPEED=GPIO_OP_HSP;
	GPIO_led.GPIO_PINCONFIG.GPIO_OUTPUT_TYPE=GPIO_OP_TYPE_PP;
	GPIO_PeriClKCtrl(GPIOA,ENABLE);
	GPIO_Init(&GPIO_led);

	GPIO_btn.pGPIOx=GPIOC;
	GPIO_btn.GPIO_PINCONFIG.GPIO_PIN_NUMBER=GPIO_PIN_NO_13;
	GPIO_btn.GPIO_PINCONFIG.GPIO_PIN_MODE=GPIO_MODE_IT_FT;
	GPIO_btn.GPIO_PINCONFIG.GPIO_PIN_SPEED=GPIO_OP_HSP;
	GPIO_PeriClKCtrl(GPIOC,ENABLE);
	GPIO_Init(&GPIO_btn);

	GPIO_IRQ_Priority_Config(IRQ_NO_EXTI15_10,IRQ_PRIO13);
	GPIO_IRQ_Interrupt_Config(IRQ_NO_EXTI15_10,ENABLE);

while(1);
}

void EXTI15_10_IRQHandler(void)
{
	GPIO_IRQHandling(GPIO_PIN_NO_13);
	GPIO_ToggleOutputPin(GPIOA, GPIO_PIN_NO_5);
	delay();
}
